In [22]:
import pandas as pd
import numpy as np

In [23]:
df = pd.read_excel('bank.xlsx', dtype=str)

In [24]:
df.head(2)

,Account No,DATE,TRANSACTION DETAILS,CHQ.NO.,VALUE DATE,WITHDRAWAL AMT,DEPOSIT AMT,BALANCE AMT,.
0,409000611074',2017-06-29 00:00:00,TRF FROM Indiaforensic SERVICES,NaN,2017-06-29 00:00:00,NaN,1000000,1000000,.
1,409000611074',2017-07-05 00:00:00,TRF FROM Indiaforensic SERVICES,NaN,2017-07-05 00:00:00,NaN,1000000,2000000,.

In [25]:
df.columns = [x.replace(" ", "_").replace(".", "_").upper() for x in df.columns]
df = df.rename(columns={'CHQ_NO_':'CHQ_NO'})

In [26]:
df.head()

,ACCOUNT_NO,DATE,TRANSACTION_DETAILS,CHQ_NO,VALUE_DATE,WITHDRAWAL_AMT,DEPOSIT_AMT,BALANCE_AMT,_
0,409000611074',2017-06-29 00:00:00,TRF FROM Indiaforensic SERVICES,NaN,2017-06-29 00:00:00,NaN,1000000,1000000,.
1,409000611074',2017-07-05 00:00:00,TRF FROM Indiaforensic SERVICES,NaN,2017-07-05 00:00:00,NaN,1000000,2000000,.
2,409000611074',2017-07-18 00:00:00,FDRL/INTERNAL FUND TRANSFE,NaN,2017-07-18 00:00:00,NaN,500000,2500000,.
3,409000611074',2017-08-01 00:00:00,TRF FRM Indiaforensic SERVICES,NaN,2017-08-01 00:00:00,NaN,3000000,5500000,.
4,409000611074',2017-08-16 00:00:00,FDRL/INTERNAL FUND TRANSFE,NaN,2017-08-16 00:00:00,NaN,500000,6000000,.

(116201, 9)

In [13]:
# df.to_csv('bank_transactions.csv', index=None)

In [28]:
df_temp = pd.read_csv('bank_transactions.csv', dtype=str)

In [29]:
df_temp.head()

,account_no,date,transaction_details,chq_no,value_date,withdrawal_amt,deposit_amt,balance_amt
0,409000611074',2017-06-29,TRF FROM Indiaforensic SERVICES,NaN,2017-06-29,NaN,1000000.0,1000000
1,409000611074',2017-07-05,TRF FROM Indiaforensic SERVICES,NaN,2017-07-05,NaN,1000000.0,2000000
2,409000611074',2017-07-18,FDRL/INTERNAL FUND TRANSFE,NaN,2017-07-18,NaN,500000.0,2500000
3,409000611074',2017-08-01,TRF FRM Indiaforensic SERVICES,NaN,2017-08-01,NaN,3000000.0,5500000
4,409000611074',2017-08-16,FDRL/INTERNAL FUND TRANSFE,NaN,2017-08-16,NaN,500000.0,6000000

In [9]:
df_temp['DATE'] = df_temp['DATE'].apply(lambda x: x[:10])

In [10]:
df_temp['VALUE_DATE'] = df_temp['VALUE_DATE'].apply(lambda x: x[:10])

In [30]:
df_temp = df_temp.fillna(np.nan)

In [31]:
df_temp.head()

,account_no,date,transaction_details,chq_no,value_date,withdrawal_amt,deposit_amt,balance_amt
0,409000611074',2017-06-29,TRF FROM Indiaforensic SERVICES,NaN,2017-06-29,NaN,1000000.0,1000000
1,409000611074',2017-07-05,TRF FROM Indiaforensic SERVICES,NaN,2017-07-05,NaN,1000000.0,2000000
2,409000611074',2017-07-18,FDRL/INTERNAL FUND TRANSFE,NaN,2017-07-18,NaN,500000.0,2500000
3,409000611074',2017-08-01,TRF FRM Indiaforensic SERVICES,NaN,2017-08-01,NaN,3000000.0,5500000
4,409000611074',2017-08-16,FDRL/INTERNAL FUND TRANSFE,NaN,2017-08-16,NaN,500000.0,6000000

In [14]:
df_temp = df_temp.drop('_', axis=1)

In [21]:
df_temp.to_csv('bank_transactions.csv', index=None)